char func(const char massiv[])
{
	int result = 0;				// Змінна, для підрахування кількості слів
	int length = 0;				// З якого індексу починаємо
	int found = 0;					// Допоміжна змінна,для визначення слово,чи ні
	while(massiv[length] !=0)			// Основний цикл , у якому через умовні оператори						
	{						
		if(massiv[length] !=' ')		// Йде перевірка кожного індексу масиву,поки не наткнемось 
		{					// На проміжок,доти йде слово, як тільки проміжок почався,
			if (found == 0)		// інкрементуємо результат , присвоюємо змінній фоунд 1.
			{
				result ++;
			}
			found = 1;
		}
		else					
		{
			found = 0;
		}
		length++;
	}
	return result;					// Повернення кінцевого результату після виконання функції
}


	
int main()
{
	const char mas[] = " Hi gitler x x x ";
	int RES = func(mas);				// Звернення до функції, використовуючи заданий масив 
}							// й отримання результату кількості слів.


