int func(const int len, int massiv[])			// функція заповнення масиву заданою кількістю простих чисел
{
	int last = 0;					// змінна для запам"ятовування останнього простого числа для подальшого використання в циклі
	int founder = 1; 				// змінна яка відповідає за визначення, просте число чи ні , якщо = 1, то число просте
	int temps = 0;					// змінна , за якою визначеється скільки вже є чисел в массиві
	while (temps < len)				// Цикл вайл виконується доти , доки масив не заповниться заданою кількістю простих чисел
	{
		for (int i = last + 1; i < 1000; i++) // Вкладений цикл, кожен новий цикл починається з останнього знайденого простого числа
		{
			founder = 1;
			for (int j = 2; j < i / 2; j++)	
			{
				if (i % j == 0)	// якщо поточне число не має остатку, то змінна фоундер = 0 , число не просте
				{
					founder = 0;
					break;
				}
			}
			if (founder != 0)		// відразу перевіряємо змінну фоундер ,
			{
				massiv[temps] = i;	// якщо число просте,добавляється в масив,запам. останнє
							// й переходимо до наступної ітерації
				last = i;
				break;
			}
		}
		temps++;				// Коли просте число добавилось у масив, інкремент довжини поточного массиву.
	}
	return 0;
}

int main()
{
	const int length = 30;
	int mas[length];

	mas[length] = func(length, mas);		// Звернення до функції використовуючи змінну довжини, та масив.
	return 0;
}



