/**
* @mainpage
* # Загальне завдання
* 1. **Розробити** 
*	Розробити функцію для знаходження таких пар чисел, де попереднє меньше наступного.
*
* # Опис програми
* 2. **Функціональне призначення**
*	Програма призначена для знаходження  пар чисел, де попереднє число меньше наступного.
* 3. **Опис логічної структури**
*	Програма складається з двух функцій, основної та допоміжнох. Допоміжна функція призначена
*	Для того,щоб обчислити сгенеровану послідовність чисел у основній функції,звертаючись до допоміжної
*	Функції з вже відомими(варіативними) аргументами.
* @author Kulish Pavlo.
* @date 23-nov-2020
*/

/**
* @file main.c
* Програма призначена для знаходження  пар чисел, де попереднє число меньше наступного.
* @author Kulish Pavlo
* @return Змінну з кількістю пар таких чисел.
* @version 0.1 
* date 23.11.2020 
*
*/

/** @func Головна функція, призначення якої підрахувати результат */
int func(const int len,int arr[])	
{						
/** @res Змінна для інрекментування,у випадку,якщо така пара збулася.  */ 
	int res = 0;
	for (int i = 0; i < len; i++)		
	{
		if (arr[i] < arr[i+1])
		{
			res++;
		}
	}
	return res;
}

/** @func2 Функція псевдовипадкового генератору чисел  rand()*/
void func2(int len,int mass[])
{
/** Цикл заповнення масиву заданою довжиною  */
	for (int i = 0; i < len; i++)    
	{				 
		mass[i] = rand();
	}


}

/** Основна функція, у якої йде звернення до функції @func */
int main()
{
/** @length Змінна довжини масиву(скільки чисел перевіряємо) */
	const int length = 4;
	int massiv[length];
	int RESULT;
	
	
/** @RESULT Кінцевий результат обислення,звертаючись до функції @func */ 
	RESULT = func(length,massiv);	  // Кінцевий результат, обичислений за допомогою звернення 	
}					  // До функції , яка використовує довжину массиву, 	
					  // та массив,для обчислення RESULT
