/**
* @mainpage
* # Загальне завдання
* 1. **Розробити** 
*	Розробити функцію для підрахування кількості слів у заданому масиві.
*
* # Опис програми
* 2. **Функціональне призначення**
*	Програма призначена для підраховування кількості слів з будь-якою довжиною проміжку.
* 3. **Опис логічної структури**
*	Є заданий масив зі словами, програма звертається до функцції викорстовуючи цей масив
*	Функція складається з циклу,у якому йде перебір кожного індексу,використовуючи умовні оператори
*	програма додає до кількості слів 1, доти " поки йде слово" як тільки воно закінчилося , 
*	йде перевірка наступного індексу , й так , поки не перевіриться весь маси.
*	Повертає результат кількості слів.
* @author Kulish Pavlo.
* @date 23-nov-2020
*/
/**
* @file main.c
* Програма призначена для підраховування кількості слів у масиві
* @author Kulish Pavlo
* @return Змінну result - кількість слів у масиві.
* @version 0.1 
* date 23.11.2020
*
*/
/** Функція підраховування кількості слів.*/			
char func(const char massiv[])			
{
/** @result  Змінна, для загальної кількості слів.*/
	int result = 0;			
/** @length Змінна поточної довжини масиву.  */
	int length = 0;				
/** @found Допоміжна змінна,за якої визначається на поточному індексу слово,або ні.  */	
	int found = 0;					
	while(massiv[length] !=0) 
	{
		if(massiv[length] !=' ')
		{	
			if (found == 0)
			{
				result ++;
			}
			found = 1;
		}
		else
		{
			found = 0;
		}
		length++;
	}
	return result;
}


/** Основна функція, яка звертається до іншої функції.  */
int main()	
{
/** @mas Заданий масив слів.  */
	const char mas[] = " Hi gitler x x x ";	
/** @RES Створюється змінна, яка звертається до функції,у якій повернено результат.  */	
	int RES = func(mas);				
}
