/**
* @mainpage
* # Загальне завдання
* 1. **Розробити** 
*	Розробити функцію для заповнення масиву заданою кількістю простих чисел.
*
* # Опис програми
* 2. **Функціональне призначення**
*	Програма призначена для заповнення масиву заданою кількістю простих чисел.
* 3. **Опис логічної структури**
*	Програма складається з функції заповненя масиву, у якій використано 3 вкладені цикли
*	(1 - цикл відповідає за кількість чисел у масиві,другий для самого числа,третій для визначення просте число чи ні
*	У основній функції отримуючи довжину(кількість чисел) масиву, програма звертається до функції використовуючи вхідні дані.
* @author Kulish Pavlo.
* @date 23-nov-2020
*/

/**
* @file main.c
* Програма призначена для заповнення масиву заданою кількістю простих чисел.
* @author Kulish Pavlo
* @return Заповнений масив з заданою кількістю простих чисел.
* @version 0.1 
* date 23.11.2020 
*
*/

/** Функція заповнення масиву простими числами*/	
int func(const int len, int massiv[])			
{

/**  @last змінна для запам"ятовування останнього простого числа для подальшого використання в циклі */
	int last = 0;					

/**  @founder змінна яка відповідає за визначення, просте число чи ні , якщо = 1, то число просте */
	int founder = 1;

/** @temps змінна , за якою визначеється скільки вже є чисел в массиві */
	int temps = 0;

/** Цикл вайл виконується доти , доки масив не заповниться заданою кількістю простих чисел */
	while (temps < len)		
	{

/** Вкладений цикл, кожен новий цикл починається з останнього знайденого простого числа */
		for (int i = last + 1; i < 1000; i++)
		{
			founder = 1;
			for (int j = 2; j < i / 2; j++)	
			{
/** якщо поточне число не має остатку, то змінна фоундер = 0 , число не просте */
				if (i % j == 0)
				{
					founder = 0;
					break;
				}
			}
/** відразу перевіряємо змінну фоундер */
			if (founder != 0)		
			{
/** якщо число просте,добавляється в масив */
				massiv[temps] = i;
/** запам*ятовуємо останне просте число й переходимо до наступної ітерації */
				last = i;
				break;
			}
		}
/** Коли просте число добавилось у масив, інкремент довжини поточного массиву.*/
		temps++;			
	}
	return 0;
}

int main()
{
/** @length Змінна довжини(скільки потрібно записати простих чисел) */
	const int length = 30;
	int mas[length];
/** Звернення до функції використовуючи змінну довжини, та @mas масив. */
	mas[length] = func(length, mas);
	return 0;
}



